{
  "Infancia" : "Nací en el que anteriormente se le llamaba Distrito Federal el 11 de Diciembre de 1995. Durante mis primeros años crecí bajo el cuidado de mis padres y el cuidado de mi abuela materna en la delegación Gustavo A. Madero, en la colonia ampliación malacates. Crecí rodeado de mi familia y, aunque era una familia modesta, nunca faltó un plato de comida en la mesa. En mi crecimiento se notó bastante que era un chico un tanto diferente, no actuaba como otros niños. Dentro de mis comportamientos estaba el obedecer ciegamente a los adultos, no salir a jugar con otros niños y sobre todo entendída las instrucciones que se me daban de manera literal. Esto no fue problema hasta que entré a la escuela primaria (Ramón Andrade Carmona) donde gracias a mi peculiar comportamiento fui objetivo de bullying por parte de muchos de mis compañeros, desde abuso verbal, agresiones físicas hasta humillaciones públicas. Durante los últimos dos años de educación primaria empecé a ser cuidado por las tardes por la familia Ramirez García, que era la familia de un amigo que hice en el kinder y también empecé a entrenar Karate-Do los fines de semana en una organización llamada 'Organización Azteca Karate Do', donde empecé a desarrollar mis habilidades físicas como la percepción espacial, coordinación ojo-mano, respiración, fuerza, foco, equilibrio y otras más. También, en ese periodo, una profesora de matemáticas cuyo nombre completo no recuerdo llamada Mayra me ayudó a descrubrir mis habilidades en matemáticas asi como el amor por las mismas. Una vez terminando mis estudios de educación primaria entré a estudiar el siguiente nivel educativo en la EST - 104, donde mi gusto y pasión por las matemáticas se vieron reforzadas en la clase de física de segundo año, donde aprendí metodologías de resolución de problemas, análisis crítico y pensamiento lógico. También durante mi educación secundaria conocí la programación con lo que era en aquel entonces el lenguate de programación llamado 'Pascal', el cual tenía una interfaz bastante sencilla. Ahí aprendí a realizar cálculos matemáticos 'complejos' sin uso de una calculadora. Por otra parte también aprendí a hacer páginas web con el bloc de notas, con estructuras sencillas, usando botones, cajas de texto y demás elementos. Ahí fue donde tuve mi primer acercamiento a la programación.",
  "Juventud" : "Durante mi juventud estuve enfocado en mis estudios. Cursé el nivel medio superior en el centro de estudios tecnológicos 'Walter Cross Buchannan'. Desafortanadamente por esas epocas no sabía realmente a lo que queria dedicarme el resto de mi vida, por ende escogí una carrera tecnica que no me interesaba del todo. A pesar de esto, terminé la carrera técnica en tres años y medio, plazo en el que conocí a varios amigos que al día de hoy (2022) sigo teniendo contacto con ellos. Durante ese periodo tuve muchos hobbies, como lo era el parkour, hacer trucos de magia, jugar cartas, ver anime y jugar videojuegos. Tuve otro acercamiento a la programación cuando curse quinto semestre, cuando llevé la asignatura de control numérico computarizado. Por otra parte, aunque me di cuenta que la mecánica no era lo mío realmente seguía sin saber que estudiar y por ende terminé esta etapa de mi vida haciendo el examen de selección de nivel superior seleccionando como primera opción a la Unidad Profesional Interdisciplinaria en Ingeniería y Tecnologías Avanzadas (UPIITA - IPN), ya que por mi cabeza rondaba la idea de que era para 'darle continuidad a mi carrera técnica', afortunadamente me quedé en la opción que seleccioné. ",
  "Adultez" : "Con la llegada de mi etapa universitaria igualmente llegó mi etapa de adulto joven, lo cual significó un cambio de paradigma en mi forma de pensar y actuar conforme me enfrentaba a nuevos retos y oportunidades de crecimiento. Durante mi primer semestre me di cuenta rapidamente que la carerra no era lo que yo esperaba, me sentía como pez en un árbol, por lo que empezó a rondar por mi cabeza la idea de cambiar de carerra para segundo semestre (mediados de 2015). Desafortunadamente, era una persona joven, y le di más importanicia a lo que mi familia pensara de mí y decidí quedarme estudiando la carrera que se podía notar que no era para mí. En varios puntos de la carrera me di cuenta que ese sentimiento por la progamación volvía a surgir de manera mas intensa con cada lenguaje que conocía. Aunque en la carrera ví lenguajes enfocados a la programación de microcontroladores y tarjetas de desarrollo había una habilidad innata para programar y un hambre por conocer más de ese mundo. Conocí lenguajes como c, c++, c#, java, javascript, python, matlab, y otros más. Finalmente, a los 27 años después de 5 dictamenes y uno que otro semestre sin cursar se me dió de baja de la carrera, ya que habían pasado los quince semestres de la misma. Fue un transcurso lento y muy cansado, pero finalmente tomé la decisión de reformar mi camino hacia el desarrollo web, tanto de front end como de backend. Hasta el momento mi lenguaje favorita ha sido Java por su clara sintaxis y su fácil manera de implementar proyectos de todo tipo, desde interfaces de usuario con java-swing hasta API REST con el framework de Springboot. Aunque en la carrera no conocí lo que eran bases de datos, aprendí de manera autodidacta gracias a la recomendación de un profesor de seguir un canal llamado Píldoras informáticas en Youtube, lo cual sinceramente estoy completamente agradecido. Actualmente me encuentro buscando trabajo como desarrollador backend con manejo de bases de datos relacionales y no relacionales, principalmente enfocado al desarrollo de aplicaciones web con spring boot."
}