{
  "Resumen" : "Me llamo Angel Ochoa, tengo 27 años y vivo en la Ciudad de México. Soy una persona ...",
  "Infancia" : "Nací en el que anteriormente se le llamaba Distrito Federal el 11 de Diciembre de 1995. Durante mis primeros años crecí bajo el cuidado de mis padres y el cuidado de mi abuela materna en la delegación Gustavo A. Madero, en la colonia ampliación malacates. Crecí rodeado de mi familia y, aunque era una familia modesta, nunca faltó un plato de comida en la mesa. En mi crecimiento se notó bastante que era un chico un tanto diferente, no actuaba como otros niños. Dentro de mis comportamientos estaba el obedecer ciegamente a los adultos, no salir a jugar con otros niños y sobre todo entendída las instrucciones que se me daban de manera literal. Esto no fue problema hasta que entré a la escuela primaria (Ramón Andrade Carmona) donde gracias a mi peculiar comportamiento fui objetivo de bullying por parte de muchos de mis compañeros, desde abuso verbal, agresiones físicas hasta humillaciones públicas. Durante los últimos dos años de educación primaria empecé a ser cuidado por las tardes por la familia Ramirez García, que era la familia de un amigo que hice en el kinder y también empecé a entrenar Karate-Do los fines de semana en una organización llamada 'Organización Azteca Karate Do', donde empecé a desarrollar mis habilidades físicas como la percepción espacial, coordinación ojo-mano, respiración, fuerza, foco, equilibrio y otras más. También, en ese periodo, una profesora de matemáticas cuyo nombre completo no recuerdo llamada Mayra me ayudó a descrubrir mis habilidades en matemáticas asi como el amor por las mismas. Una vez terminando mis estudios de educación primaria entré a estudiar el siguiente nivel educativo en la EST - 104, donde mi gusto y pasión por las matemáticas se vieron reforzadas en la clase de física de segundo año, donde aprendí metodologías de resolución de problemas, análisis crítico y pensamiento lógico. También durante mi educación secundaria conocí la programación con lo que era en aquel entonces el lenguate de programación llamado 'Pascal', el cual tenía una interfaz bastante sencilla. Ahí aprendí a realizar cálculos matemáticos 'complejos' sin uso de una calculadora. Por otra parte también aprendí a hacer páginas web con el bloc de notas, con estructuras sencillas, usando botones, cajas de texto y demás elementos. Ahí fue donde tuve mi primer acercamiento a la programación.",
  "Juventud" : "Durante mi juventud estuve enfocado en mis estudios. Cursé el nivel medio superior en el centro de estudios tecnológicos 'Walter Cross Buchannan'. Desafortanadamente por esas epocas no sabía realmente a lo que queria dedicarme el resto de mi vida, por ende escogí una carrera tecnica que no me interesaba del todo. A pesar de esto, terminé la carrera técnica en tres años y medio, plazo en el que conocí a varios amigos que al día de hoy (2022) sigo teniendo contacto con ellos. ",
  "Adultez" : "Llegando a mi vida adulta pasaron varios eventos que cambiarían mi forma de ver la vida. En la universidad ..."
}