{
  "Nivel Superior" : { "Escuela" : "Instituto Politécnico Nacional", "Unidad" : "Unidad Profesional Interdisciplinaria en Investigación y Tecnologías Avanzadas", "Inicio" : "2014", "Fin" : "2023", "Documento" : "Certificado Parcial De Estudios", "Descripción" : "Durante mi trayectoria académica en esta institución pude desarrollar habilidades en programación, como conocer lo que son los diferentes paradigmas que existen, habilidades sobre algunos lenguajes como lo son Java, JavaScript, C++, C#, Matlab, Python, Arduino, etc. y tuve la oportunidad de desarrollar un software de simulación web 3D para resistencia de materiales en el cual pude poner a prueba mis habilidades de desarrollador de software y de desarrollador web.", "src" : "NivelSuperior.jpg", "align" : "right" },
  "Nivel Medio Superior" : { "Escuela" : "Instituto Politécnico Nacional", "Unidad" : "CET 1 - 'Walter Cross Buchanan'", "Inicio" : "2010", "Fin" : "2014", "Documento" : "Certificado De Estudios - Carta Pasante", "Descripción" : "Durante el tiempo que estuve estudiando dentro de este centro de estudios, adquirí habilidades en programación de una fresadora CNC así como un pensamiento lógico secuencial sobre el cómo escribir sentencias para poder ser comprendidas por un compilador para ejecutar una tarea en específica. Aunque estudié una carrera técnica en Mecánica Industrial no me sentí identificado con la mayoría de asignaturas que no tuvieran que ver con las matemáticas o programación.", "src" : "NivelMedioSuperior.jpg", "align" : "left" },
  "Secundaria" : { "Escuela" : "Escuela Secundaria Técnica", "Unidad" : "No. 104 - 'Ing. Martín López Rito'", "Inicio" : "2007", "Fin" : "2010", "Documento" : "Diploma", "Descripción" : "Lo único relevante de mencionar sobre mi educación secundaria es que aquí fue donde encontré el amor por la programación, conocí lo que era Pascal para operaciones matemáticas pero sobre todo, lo más importante es que aprendí lo básico de HTML, haciendo páginas web en bloc de notas usando las diferentes etiquetas, varios selectores, e incluso scripts básicos en javascript.", "src" : "Secundaria.jpg", "align" : "right" }
}